export const CommonQuestionsData = [
  {
    title: "صبابار بارنامه صادر می کند؟",
    desc: "بله صبابار علاوه بر حواله ، بارنامه هم صادر می کند و صدور بارنامه های آن از طریق شرکت های باربری صورت می گیرد.",
  },
  {
    title:
      "اگر از صاحب بار یا شرکت باربری ناراضی باشم ، چگونه می توانم به صبابار اعلام کنم؟",
    desc: "در صورت رضایت یا عدم رضایت از شرکت های باربری یا صاحبان بار می توانید در پایان سیر خود از طریق بخش نظرسنجی ، نظر خود را اعلام کنید",
  },
  {
    title: "پرداخت بارنامه های در صبابار چگونه انجام می شوند؟",
    desc: "پس از پایان سیر خود می توانید از طریق شبا یا صباکارت کرایه خود را از صبابار دریافت کنید",
  },
];
