interface EducationItemType {
  id: string;
  title: string;
  items: {
    text?: string;
    img?: string;
  }[];
}

const EducationItems: EducationItemType[] = [
  {
    id: "register",
    title: "تکمیل ثبت نام",
    items: [
      {
        text: "برای تکمیل ثبت نام می توانید وارد بخش  پروفایل شده و بر روی دکمه «شروع فرایند ثبت نام» کلیک کنید",
        img: "1.svg",
      },
      {
        text: "در مرحله اول تکمیل ثبت نام شما باید کدملی و تاریخ تولد خود را وارد کنید و در ادامه بر روی دکمه «ثبت و ادامه» کلیک کنیدتوجه کنید که کدملی و تاریخ تولد هر دو به نام شما باشند ",
        img: "2.svg",
      },
      {
        text: "سپس در صفحه اطلاعات کاربری نام و نام خانوادگی شما قابل نمایش خواهد بود و شما امکان افزودن شهر محل زندگی ، تحصیلات و تصویر پروفایل هم بصورت اختیاری دارید",
        img: "3.svg",
      },
      {
        text: "در مرحله بعد ، شما باید اولین ناوگان خود را ثبت کنید تا ثبت نام شما تکمیل شود.ابتدا از بین 5 نوع ناوگان ، نوع ناوگان خود را انتخاب کنید و سپس بر روی دکمه «تایید نوع ناوگان» کلیک کنید.",
        img: "4.svg",
      },
      {
        text: "سپس سایر اطلاعات ناوگان خود را به ترتیب و به صورت صحیح وارد کنید و در نهایت بر روی دکمه «تایید اطلاعات ناوگان» کلیک کنید.",
        img: "5.svg",
      },
      {
        text: "اکنون ثبت نام شما تکمیل شده است.",
      },
    ],
  },

  {
    id: "load-reservation",
    title: "رزور بار",
    items: [
      {
        text: "برای رزرو بار پس از تکمیل ثبت نام خود وارد بخش لیست بار ها شوید :",
        img: "1.svg",
      },
      {
        text: "در صفحه لیست بارها می توانید بار مدنظر خود را با انتخاب مسیر و روز پیدا کنید و در نهایت با کلیک بر روی دکمه «مشاهده بار» بار مدنظر خود ، اطلاعات بیشتری از آن را در صفحه اطلاعات بار مشاهده کنید :",
        img: "2.svg",
      },
      {
        text: "سپس در صفحه ی اطلاعات بار ، با توجه به اطلاعات بار ، اگر بار را خواستید می توانید با کلیک بر روی دکمه ی قبول کردن بار ، فرایند رزرو بار را ادامه دهید و وارد صفحه قبول بار شویددر صورتی که بار مورد نظر را نخواستید با کلیک بر روی دکمه ی برگشت به عقب می توانید بار دیگری را در صفحه ی «لیست بارها» انتخاب کنید",
        img: "3.svg",
      },
      {
        text: "در صفحه قبول بار یکی از ناوگان های خود را برای سیر انتخاب می کنید و در صورتی که راننده دوم هم دارید ، با کلیک بر روی دکمه افزودن آن را اضافه می کنید.در آخر با کلیک بر روی دکمه «درخواست حواله» بار را دریافت خواهید کرد و می توانید بار را از بخش «وضعیت بار» مدیریت کنید",
        img: "4.svg",
      },
    ],
  },

  {
    id: "add-vehicle",
    title: "افزودن ناوگان",
    items: [
      {
        text: "برای افزودن ناوگان می توانید وارد بخش پروفایل شده و با کلیک بر قسمت «ناوگان های من» وارد صفحه ناوگان ها شوید.    ",
        img: "1.svg",
      },
      {
        text: "سپس با کلیک بر روی دکمه ی «افزودن ناوگان» می توانید یک ناوگان اضافه کنید.",
        img: "2.svg",
      },
      {
        text: "سپس در صفحه افزودن ناوگان ، نوع ناوگان خود را انتخاب کنید و بر دکمه «تایید نوع ناوگان» کلیک کنید.",
        img: "3.svg",
      },
      {
        text: "سپس سایر اطلاعات ناوگان خود را به ترتیب و به صورت صحیح وارد کنید و در نهایت بر روی دکمه «تایید اطلاعات ناوگان» کلیک کنید.",
        img: "4.svg",
      },
      {
        text: "در صورت صحت اطلاعات وارد شده ، ناوگان شما به صفحه ناوگان های من اضافه خواهد شد.",
      },
    ],
  },

  {
    id: "receive-remittance",
    title: "دریافت بارنامه",
    items: [
      {
        text: "برای دریافت بارنامه ، در صورتی که از طریق صبابار بار رزرو کرده باشید ، می توانید با مراجعه به بخش وضعیت بار ، در صورتی که تصویر باسکول بارگیری خود را ثبت کرده باشید ، وارد صفحه در انتظار بارنامه خواهید شد و پس از آن امکان دریافت بارنامه خود را با کلیک بر روی دکمه «مشاهده بارنامه» خواهید داشت.",
        img: "1.svg",
      },
    ],
  },

  {
    id: "receive-bill-lading",
    title: "دریافت حواله",
    items: [
      {
        text: "برای دریافت حواله در صورتی که از طریق صبابار بار رزرو کرده باشید ، می توانید با مراجعه به بخش وضعیت بار ، بار های فعال خود را مشاهده کنید و با کلیک بر روی دکمه «مشاهده حواله» حواله خود را دریافت کنید.",
        img: "1.svg",
      },
      {
        text: "در صورتی که وضعیت بار شما در حالت در انتظار حواله باشد و با صفحه زیر مواجه می شوید و باید تا انتظار حواله توسط شرکت باربری منتظر بمانید ، سپس بصورت خودکار به صفحه صدور حواله منتقل خواهید شد و امکان دریافت حواله را خواهید داشت.",
        img: "2.svg",
      },
    ],
  },

  {
    id: "upload-image",
    title: "آپلود تصویر باسکول",
    items: [
      {
        text: "برای آپلود تصویر باسکول تخلیه یا بارگیری ، در صفحه وضعیت بار ، بر روی دکمه های «ثبت وزن تخلیه» یا «ثبت وزن بارگیری» کلیک می کنید و سپس امکان آپلود تصویر خود را خواهید داشت.",
        img: "1.svg",
      },
      {
        img: "2.svg",
      },
    ],
  },

  {
    id: "bill-lading-payment",
    title: "پرداخت بارنامه",
    items: [
      {
        text: "در هر سیر پس از ثبت وزن تخلیه و آپلود تصویر باسکول تخلیه به صفحه ی زیر منتقل می شوید که در آن ابتدا باید روش دریافت کرایه خود را مشخص کنید :",
        img: "1.svg",
      },
      {
        text: "سپس در صورتی که پرداخت از طریق صباکارت را انتخاب کنید وارد صفحه زیر خواهید شد که با انتخاب صباکارت پرداخت شما انجام خواهد شد :",
        img: "2.svg",
      },
      {
        text: "و در صورتی که پرداخت از طریق شبا را انتخاب کنید وارد صفحه زیر می شوید که در آن شبا هایی که در گذشته از طریق آن ها پرداخت داشته اید را مشاهده می کنید و می توانید با کلیک بر روی دکمه «افزودن شبا» به آنها اضافه هم کنید :",
        img: "3.svg",
      },
      {
        text: "در نهایت از هر طریقی که دریافت کرایه خود را انجام داده باشید ، وارد صفحه زیر می شوید و کرایه شما اگر از طریق صباکارت باشد تا پایان روز اداری و اگر از طریق شبا باشد تا 48 ساعت برای شما ارسال خواهد شد.",
        img: "4.svg",
      },
    ],
  },

  {
    id: "view-history",
    title: "مشاهده سابقه سیرها",
    items: [
      {
        text: "برای مشاهده سابقه سیر ها و دسترسی به اطلاعات آنها ابتدا وارد بخش پروفایل شوید و بر قسمت سابقه سیر ها کلیک کنید.",
        img: "1.svg",
      },
      {
        text: "سپس می توانید با کلیک بر روی دکمه اطلاعات بیشتر ، اطلاعات بیشتری از سیر های گذشته تان را مشاهده کنید.",
        img: "2.svg",
      },
      {
        text: "در صفحه اطلاعات سیر می توانید همه اطلاعات مرتبط با سیر انتخابی تان را به صورت دسته بندی مشاهده کنید.",
        img: "3.svg",
      },
    ],
  },
];

export default EducationItems;
